Ran Plan for 12 projects:

1. dir: `argo` workspace: `default`
1. dir: `cloudflare` workspace: `default`
1. dir: `gcp/organization` workspace: `default`
1. dir: `gcp/projects/firebees` workspace: `default`
1. dir: `gcp/projects/homelab-ng` workspace: `default`
1. dir: `gcp/projects/jonpulsifer` workspace: `default`
1. dir: `gcp/projects/kubesec` workspace: `default`
1. dir: `gcp/projects/lolcorp` workspace: `default`
1. dir: `gcp/projects/trusted-builds` workspace: `default`
1. dir: `gcp/projects/wishin-app` workspace: `default`
1. dir: `unifi` workspace: `default`
1. dir: `workspace` workspace: `default`
---

### 2. dir: `cloudflare` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
! update in-place

Terraform will perform the following actions:

  # cloudflare_zone_dnssec.pulsifer_ca_dnssec will be updated in-place
! resource "cloudflare_zone_dnssec" "pulsifer_ca_dnssec" {
+       algorithm        = (known after apply)
+       digest           = (known after apply)
+       digest_algorithm = (known after apply)
+       digest_type      = (known after apply)
+       ds               = (known after apply)
+       flags            = (known after apply)
        id               = "7b0fdf753795ec69a1318f64be8d2479"
+       key_tag          = (known after apply)
+       key_type         = (known after apply)
+       modified_on      = (known after apply)
+       public_key       = (known after apply)
-       status           = "disabled" -> null
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 3. dir: `gcp/organization` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
! update in-place

Terraform will perform the following actions:

  # google_organization_iam_policy.organization will be updated in-place
! resource "google_organization_iam_policy" "organization" {
        id          = "5046617773"
!       policy_data = jsonencode(
!           {
!               bindings = [
-                   {
-                       members = [
-                           "group:cloud@pulsifer.ca",
                        ]
-                       role    = "roles/billing.user"
                    },
-                   {
-                       members = [
-                           "group:cloud@pulsifer.ca",
                        ]
-                       role    = "roles/cloudkms.admin"
                    },
-                   {
-                       members = [
-                           "group:cloud@pulsifer.ca",
                        ]
-                       role    = "roles/cloudsupport.admin"
                    },
-                   {
-                       members = [
-                           "group:cloud@pulsifer.ca",
                        ]
-                       role    = "roles/iam.organizationRoleAdmin"
                    },
                    {
                        members = [
                            "group:cloud@pulsifer.ca",
                        ]
                        role    = "roles/orgpolicy.policyAdmin"
                    },
                    {
                        members = [
                            "group:cloud@pulsifer.ca",
                        ]
                        role    = "roles/owner"
                    },
-                   {
-                       members = [
-                           "group:cloud@pulsifer.ca",
                        ]
-                       role    = "roles/pubsub.admin"
                    },
                    {
                        members = [
                            "group:cloud@pulsifer.ca",
                        ]
                        role    = "roles/resourcemanager.folderAdmin"
                    },
                    # (1 unchanged element hidden)
                    {
                        members = [
                            "group:cloud@pulsifer.ca",
                        ]
                        role    = "roles/resourcemanager.projectCreator"
                    },
-                   {
-                       members = [
-                           "group:cloud@pulsifer.ca",
                        ]
-                       role    = "roles/securitycenter.admin"
                    },
                    {
                        members = [
                            "serviceAccount:service-org-5046617773@security-center-api.iam.gserviceaccount.com",
                        ]
                        role    = "roles/securitycenter.serviceAgent"
                    },
                ]
            }
        )
        # (2 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 0 to add, 1 to change, 0 to destroy.

---
### 5. dir: `gcp/projects/homelab-ng` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.cloudflare_ip_ranges.cloudflare: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
! update in-place
- destroy

Terraform will perform the following actions:

  # google_firestore_database.default will be destroyed
  # (because google_firestore_database.default is not in configuration)
- resource "google_firestore_database" "default" {
-       app_engine_integration_mode       = "ENABLED" -> null
-       concurrency_mode                  = "PESSIMISTIC" -> null
-       create_time                       = "2022-05-28T18:58:58.152234Z" -> null
-       database_edition                  = "STANDARD" -> null
-       delete_protection_state           = "DELETE_PROTECTION_DISABLED" -> null
-       deletion_policy                   = "ABANDON" -> null
-       earliest_version_time             = "2025-12-12T22:16:33.972903Z" -> null
-       etag                              = "IMKYvZ6XuZEDMNrRgODe3Y8D" -> null
-       id                                = "projects/homelab-ng/databases/(default)" -> null
-       key_prefix                        = "k" -> null
-       location_id                       = "northamerica-northeast1" -> null
-       name                              = "(default)" -> null
-       point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED" -> null
-       project                           = "homelab-ng" -> null
-       type                              = "FIRESTORE_NATIVE" -> null
-       uid                               = "c15b3c55-6911-453a-b0e8-1c833d3a323d" -> null
-       update_time                       = "2022-05-28T18:58:58.152234Z" -> null
-       version_retention_period          = "3600s" -> null
    }

  # google_iam_workload_identity_pool_provider.vercel will be updated in-place
! resource "google_iam_workload_identity_pool_provider" "vercel" {
!       attribute_condition                = "assertion.sub.startsWith('owner:jonpulsifers-projects:project:')" -> "assertion.sub.startsWith('owner:jonpulsifers-projects:project:') && assertion.environment == 'production'"
        id                                 = "projects/homelab-ng/locations/global/workloadIdentityPools/homelab/providers/vercel"
        name                               = "projects/629296473058/locations/global/workloadIdentityPools/homelab/providers/vercel"
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_project_iam_binding.firestore_database_reader will be destroyed
  # (because google_project_iam_binding.firestore_database_reader is not in configuration)
- resource "google_project_iam_binding" "firestore_database_reader" {
-       etag    = "BwZFtnvARGA=" -> null
-       id      = "homelab-ng/roles/datastore.viewer" -> null
-       members = [
-           "principalSet://iam.googleapis.com/projects/629296473058/locations/global/workloadIdentityPools/homelab/attribute.repository/jonpulsifer/ts",
        ] -> null
-       project = "homelab-ng" -> null
-       role    = "roles/datastore.viewer" -> null
    }

  # google_project_iam_binding.firestore_database_user will be destroyed
  # (because google_project_iam_binding.firestore_database_user is not in configuration)
- resource "google_project_iam_binding" "firestore_database_user" {
-       etag    = "BwZFtnvARGA=" -> null
-       id      = "homelab-ng/roles/datastore.user" -> null
-       members = [
-           "principal://iam.googleapis.com/projects/629296473058/locations/global/workloadIdentityPools/homelab/subject/owner:jonpulsifers-projects:project:slingshot:environment:development",
-           "principal://iam.googleapis.com/projects/629296473058/locations/global/workloadIdentityPools/homelab/subject/owner:jonpulsifers-projects:project:slingshot:environment:production",
-           "serviceAccount:view-counter@homelab-ng.iam.gserviceaccount.com",
        ] -> null
-       project = "homelab-ng" -> null
-       role    = "roles/datastore.user" -> null
    }

  # google_project_iam_member.view_counter_firestore will be created
+ resource "google_project_iam_member" "view_counter_firestore" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = "serviceAccount:view-counter@homelab-ng.iam.gserviceaccount.com"
+       project = "homelab-ng"
+       role    = "roles/datastore.user"
    }

  # google_service_account_iam_policy.terraform_token_creator will be updated in-place
! resource "google_service_account_iam_policy" "terraform_token_creator" {
        id                 = "projects/homelab-ng/serviceAccounts/terraform@homelab-ng.iam.gserviceaccount.com"
!       policy_data        = jsonencode(
!           {
!               bindings = [
                    {
                        members = [
                            "group:cloud@pulsifer.ca",
                            "serviceAccount:terraform@homelab-ng.iam.gserviceaccount.com",
                        ]
                        role    = "roles/iam.serviceAccountTokenCreator"
                    },
+                   {
+                       members = [
+                           "group:cloud@pulsifer.ca",
                        ]
+                       role    = "roles/iam.serviceAccountUser"
                    },
                ]
            }
        )
        # (2 unchanged attributes hidden)
    }

  # google_storage_bucket.free will be updated in-place
! resource "google_storage_bucket" "free" {
        id                          = "homelab-ng-free"
        name                        = "homelab-ng-free"
        # (17 unchanged attributes hidden)

+       lifecycle_rule {
+           action {
+               type          = "Delete"
                # (1 unchanged attribute hidden)
            }
+           condition {
+               age                    = 1
+               matches_prefix         = []
+               matches_storage_class  = []
+               matches_suffix         = []
+               with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 3 to destroy.
```
</details>

This plan was not saved because one or more projects failed and automerge requires all plans pass.
Plan: 1 to add, 3 to change, 3 to destroy.

---
### 11. dir: `unifi` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform init -input=false' in '/atlantis-data/repos/jonpulsifer/infra/363/default/unifi': exit status 1
Initializing the backend...

Successfully configured the backend "gcs"! Terraform will automatically
use this backend unless the backend configuration changes.
╷
│ Error: Terraform encountered problems during initialisation, including problems
│ with the configuration, described below.
│ 
│ The Terraform configuration must be valid before initialization so that
│ Terraform can determine which modules and providers need to be installed.
│ 
│ 
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 2, in locals:
│    2:   fml_cidr   = "10.1.0.0/24"
│ 
│ A local value named "fml_cidr" was already defined at home.tf:2,3-29. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 3, in locals:
│    3:   fml_domain = "fml.pulsifer.ca"
│ 
│ A local value named "fml_domain" was already defined at home.tf:3,3-33.
│ Local value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 4, in locals:
│    4:   fml_wlan   = "fml"
│ 
│ A local value named "fml_wlan" was already defined at home.tf:4,3-21. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 5, in locals:
│    5:   clients    = yamldecode(file("./clients.yaml"))
│ 
│ A local value named "clients" was already defined at home.tf:5,3-50. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 6, in locals:
│    6:   one_day    = 86400
│ 
│ A local value named "one_day" was already defined at home.tf:6,3-21. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate local value definition
│ 
│   on management.tf line 7, in locals:
│    7:   one_week   = local.one_day * 7
│ 
│ A local value named "one_week" was already defined at home.tf:7,3-33. Local
│ value names must be unique within a module.
╵
╷
│ Error: Duplicate resource "unifi_network" configuration
│ 
│   on management.tf line 10:
│   10: resource "unifi_network" "fml" {
│ 
│ A unifi_network resource named "fml" was already declared at
│ home.tf:10,1-31. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate data "unifi_ap_group" configuration
│ 
│   on management.tf line 32:
│   32: data "unifi_ap_group" "all_aps" {
│ 
│ A unifi_ap_group data resource named "all_aps" was already declared at
│ home.tf:32,1-32. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate data "vault_generic_secret" configuration
│ 
│   on management.tf line 36:
│   36: data "vault_generic_secret" "wifi" {
│ 
│ A vault_generic_secret data resource named "wifi" was already declared at
│ home.tf:36,1-35. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_wlan" configuration
│ 
│   on management.tf line 40:
│   40: resource "unifi_wlan" "fml" {
│ 
│ A unifi_wlan resource named "fml" was already declared at home.tf:40,1-28.
│ Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 58:
│   58: resource "unifi_user" "personal_devices" {
│ 
│ A unifi_user resource named "personal_devices" was already declared at
│ home.tf:58,1-41. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 73:
│   73: resource "unifi_user" "computers" {
│ 
│ A unifi_user resource named "computers" was already declared at
│ home.tf:73,1-34. Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 88:
│   88: resource "unifi_user" "iot" {
│ 
│ A unifi_user resource named "iot" was already declared at home.tf:88,1-28.
│ Resource names must be unique per type in each module.
╵
╷
│ Error: Duplicate resource "unifi_user" configuration
│ 
│   on management.tf line 103:
│  103: resource "unifi_user" "cameras" {
│ 
│ A unifi_user resource named "cameras" was already declared at
│ home.tf:103,1-32. Resource names must be unique per type in each module.
╵

```
</details>

---
### Plan Summary

12 projects, 3 with changes, 8 with no changes, 1 failed